src/MOVED_XRoadFolkRaw/Login.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:x="http://x-road.eu/xsd/x-road.xsd" xmlns:prod="http://us-folk-v2.x-road.eu/producer">
    <soapenv:Header>
        <xro:service iden:objectType="SERVICE">
            <iden:xRoadInstance>FO</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>405388</iden:memberCode>
            <!--Optional:-->
            <iden:subsystemCode>us-folk-v2</iden:subsystemCode>
            <iden:serviceCode>Login</iden:serviceCode>
            <!--Optional:-->
            <iden:serviceVersion>v1</iden:serviceVersion>
        </xro:service>
        <xro:client iden:objectType="SUBSYSTEM">
            <iden:xRoadInstance>FO</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>345334</iden:memberCode>
            <!--Optional:-->
            <iden:subsystemCode>HN-Tardis</iden:subsystemCode>
        </xro:client>
        <xro:id>123</xro:id>
        <xro:protocolVersion>4.0</xro:protocolVersion>
        <x:service>us-folk-v2.Login.v1</x:service>
        <x:id>?</x:id>
        <x:userId>?</x:userId>
        <x:producer>us-folk-v2</x:producer>
        <x:consumer>345334</x:consumer>
    </soapenv:Header>
    <soapenv:Body>
        <prod:Login>
            <request>
                <username>s2sLSadv</username>
                <password>pUn4cr6buDrU</password>
            </request>
        </prod:Login>
    </soapenv:Body>
</soapenv:Envelope>